rhoSimpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       2425;
    }
    sym
    {
        type            patch;
        nFaces          25;
        startFace       2450;
    }
    wedge
    {
        type            patch;
        nFaces          25;
        startFace       2475;
    }
    top
    {
        type            patch;
        nFaces          50;
        startFace       2500;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1250;
        startFace       2550;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1250;
        startFace       3800;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       5050;
    }
)

// ************************************************************************* //
